# Parameter Type Id Energy Analysis Window Type Json Property

Source: https://www.revitapidocs.com/2026/112f6830-5568-f517-710c-8e06f17f745c.htm

---

| Parameter Type Id Energy Analysis Window Type Json Property |
| --- |

"JSON data for Window Types"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId EnergyAnalysisWindowTypeJson { get; }
```

```
Public Shared ReadOnly Property EnergyAnalysisWindowTypeJson As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ EnergyAnalysisWindowTypeJson {
	ForgeTypeId^ get ();
}
```

```
static member EnergyAnalysisWindowTypeJson : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace